---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsRunStructural
source: html/9148f2dc-3882-4018-8175-dec27b1cc611.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsRunStructural Property

"Structural": Structural

## Syntax (C#)
```csharp
public static ForgeTypeId StairsRunStructural { get; }
```